Revit 2027 API
IFCOpeningDimensions.Depth Property
 The depth of the opening.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Depth { get; set; }
Public Property Depth As Double
	Get
	Set
public:
property double Depth {
	double get ();
	void set (double value);
}
member Depth : float with get, set
Property Value
Double
See Also
Reference
IFCOpeningDimensions Class
Autodesk.Revit.DB.IFC Namespace